leetcode_2_add_two_numbers.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2. Add Two Numbers</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">
</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2. Add Two Numbers</h1>
<p>
This problem can be solved using the add algorithm that we learned on the school, and I don't know why it is marked as medium in Leetcode.  The following algorithm uses <a href="recursion.html#ID-D9849396-EA57-4F4F-BA34-D8910B8422F0">Recursion</a> to compute for each pair of digits until there is no more digits to add up.
</p>
</div>
</body>
</html>